import 'network/weather_api_service.dart';

Future<void> main() async {
  /* Напиши прогу которая взаимодействует с юзером посредством ВВОДА и ВЫВОДА
  в консоль. Реализуй все, что только можно из апи погоды. Первую строчку я 
  напишу за тебя. Помни, что юзер может вводить что-то что ты не ожидаешь. 
  Апишка грамотно реагирует на неправильные запросы, будет ли твоя прога 
  также отзывычива?? А??

  Первую строчку я по-братски пишу за тебя, она идеальна и неприкосновенна.

  P.S.: Конечно же ничего дописывать в другие файлы, которая уже написаны нельзя.
  Но если нужно ты можешь добавить свои, но не в папку network!
  */
}
